In [2]:
import pandas as pd
import numpy as np

C:\Users\HP\AppData\Local\Temp\ipykernel_23636\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

## pirma dalis
---

In [3]:
labels = ('vardas', 'pavardė', 'amžius')
zmogus = ('Geras', 'Zmogelis', 33)
print(labels, zmogus)

('vardas', 'pavardė', 'amžius') ('Geras', 'Zmogelis', 33)

In [4]:
pd.Series(data=zmogus)

0       Geras
1    Zmogelis
2          33
dtype: object

In [5]:
pd.Series(data=zmogus, index=labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [6]:
zmogus_dict = {
    'vardas': 'Smagus',
    'pavarde': 'Giedriukas',
    'amzius': 36
}
zmogus_dict

{'vardas': 'Smagus', 'pavarde': 'Giedriukas', 'amzius': 36}

In [7]:
zmogus_pd = pd.Series(zmogus_dict)
zmogus_pd

vardas         Smagus
pavarde    Giedriukas
amzius             36
dtype: object

In [8]:
pd.Series(zmogus, labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [9]:
zmogus_pd['amzius']

36

In [10]:
miestai = pd.Series((500, 400, 300, 200), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
miestai

Vilnius     500
Kaunas      400
Klaipeda    300
Siauliai    200
dtype: int64

In [11]:
augimas = pd.Series((1.5, 1.3, 0.9, 0.7), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
augimas

Vilnius     1.5
Kaunas      1.3
Klaipeda    0.9
Siauliai    0.7
dtype: float64

In [12]:
miestai * augimas

Vilnius     750.0
Kaunas      520.0
Klaipeda    270.0
Siauliai    140.0
dtype: float64

In [13]:
betko7x7 = np.random.randint(10, 100, (7, 7))
betko7x7

array([[45, 70, 90, 93, 54, 63, 80],
       [70, 60, 79, 34, 25, 32, 13],
       [69, 88, 89, 83, 58, 13, 97],
       [27, 67, 58, 41, 91, 93, 11],
       [10, 31, 46, 58, 27, 42, 15],
       [97, 22, 39, 86, 27, 27, 83],
       [66, 84, 75, 23, 12, 43, 43]])

In [14]:
miestu_skaiciai = pd.DataFrame(
    betko7x7,
    [2000, 2004, 2008, 2012, 2016, 2020, 2024],
    ['Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai', 'Panevezys', 'Alytus', 'Druskininkai']
)
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Siauliai  Panevezys  Alytus  Druskininkai
2000       45      70        90        93         54      63            80
2004       70      60        79        34         25      32            13
2008       69      88        89        83         58      13            97
2012       27      67        58        41         91      93            11
2016       10      31        46        58         27      42            15
2020       97      22        39        86         27      27            83
2024       66      84        75        23         12      43            43

In [15]:
miestu_skaiciai['Klaipeda']

2000    90
2004    79
2008    89
2012    58
2016    46
2020    39
2024    75
Name: Klaipeda, dtype: int32

In [16]:
print(type(miestu_skaiciai['Klaipeda']))
print(type(miestu_skaiciai))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
miestu_skaiciai[['Vilnius', 'Alytus', 'Druskininkai']]

      Vilnius  Alytus  Druskininkai
2000       45      63            80
2004       70      32            13
2008       69      13            97
2012       27      93            11
2016       10      42            15
2020       97      27            83
2024       66      43            43

In [18]:
miestu_skaiciai['Vilnius'][2000] = 99
miestu_skaiciai['Vilnius'][2000]

C:\Users\HP\AppData\Local\Temp\ipykernel_23636\2762690240.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  miestu_skaiciai['Vilnius'][2000] = 99

99

In [19]:
miestu_skaiciai.loc[2012]

Vilnius         27
Kaunas          67
Klaipeda        58
Siauliai        41
Panevezys       91
Alytus          93
Druskininkai    11
Name: 2012, dtype: int32

In [20]:
kazluruda = pd.Series(np.random.randint(10, 99, 7), np.arange(2000, 2025, 4))
kazluruda

2000    31
2004    66
2008    86
2012    65
2016    44
2020    35
2024    66
dtype: int32

In [21]:
miestu_skaiciai['Kazlu Ruda'] = kazluruda
miestu_skaiciai

,Vilnius,Kaunas,Klaipeda,Siauliai,Panevezys,Alytus,Druskininkai,Kazlu Ruda
2000,99,70,90,93,54,63,80,31
2004,70,60,79,34,25,32,13,66
2008,69,88,89,83,58,13,97,86
2012,27,67,58,41,91,93,11,65
2016,10,31,46,58,27,42,15,44
2020,97,22,39,86,27,27,83,35
2024,66,84,75,23,12,43,43,66

In [22]:
miestu_skaiciai.drop('Siauliai', axis=1, inplace=True)

In [23]:
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      70        90         54      63            80          31
2004       70      60        79         25      32            13          66
2008       69      88        89         58      13            97          86
2012       27      67        58         91      93            11          65
2016       10      31        46         27      42            15          44
2020       97      22        39         27      27            83          35
2024       66      84        75         12      43            43          66

In [24]:
miestai_be_2008 = miestu_skaiciai.drop(2008)
miestai_be_2008

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      70        90         54      63            80          31
2004       70      60        79         25      32            13          66
2012       27      67        58         91      93            11          65
2016       10      31        46         27      42            15          44
2020       97      22        39         27      27            83          35
2024       66      84        75         12      43            43          66

In [25]:
miestu_skaiciai.loc[2008]

Vilnius         69
Kaunas          88
Klaipeda        89
Panevezys       58
Alytus          13
Druskininkai    97
Kazlu Ruda      86
Name: 2008, dtype: int32

In [26]:
miestu_skaiciai.iloc[3]

Vilnius         27
Kaunas          67
Klaipeda        58
Panevezys       91
Alytus          93
Druskininkai    11
Kazlu Ruda      65
Name: 2012, dtype: int32

In [27]:
miestu_skaiciai['Vilnius'][2020]

97

In [28]:
miestu_skaiciai.loc[2020, 'Vilnius']

97

In [29]:
miestu_skaiciai.loc[[2012, 2020, 2024], ['Kaunas', 'Alytus']]

      Kaunas  Alytus
2012      67      93
2020      22      27
2024      84      43

In [30]:
miestu_skaiciai[['Kaunas', 'Alytus']].loc[[2020, 2012, 2000]]

      Kaunas  Alytus
2020      22      27
2012      67      93
2000      70      63

In [31]:
miestu_skaiciai[miestu_skaiciai > 70]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000     99.0     NaN      90.0        NaN     NaN          80.0         NaN
2004      NaN     NaN      79.0        NaN     NaN           NaN         NaN
2008      NaN    88.0      89.0        NaN     NaN          97.0        86.0
2012      NaN     NaN       NaN       91.0    93.0           NaN         NaN
2016      NaN     NaN       NaN        NaN     NaN           NaN         NaN
2020     97.0     NaN       NaN        NaN     NaN          83.0         NaN
2024      NaN    84.0      75.0        NaN     NaN           NaN         NaN

In [32]:
print(miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 50])

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      70        90         54      63            80          31
2004       70      60        79         25      32            13          66
2008       69      88        89         58      13            97          86
2012       27      67        58         91      93            11          65
2024       66      84        75         12      43            43          66

In [33]:
miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 80][['Vilnius', 'Klaipeda']]

      Vilnius  Klaipeda
2000       99        90
2008       69        89

In [34]:
miestu_skaiciai[(miestu_skaiciai['Vilnius'] > 90) | (miestu_skaiciai['Klaipeda'] > 80)]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      70        90         54      63            80          31
2008       69      88        89         58      13            97          86
2020       97      22        39         27      27            83          35

In [35]:
miestu_skaiciai.reset_index()

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,70,90,54,63,80,31
1,2004,70,60,79,25,32,13,66
2,2008,69,88,89,58,13,97,86
3,2012,27,67,58,91,93,11,65
4,2016,10,31,46,27,42,15,44
5,2020,97,22,39,27,27,83,35
6,2024,66,84,75,12,43,43,66

In [36]:
be_indekso = miestu_skaiciai.reset_index()
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,70,90,54,63,80,31
1,2004,70,60,79,25,32,13,66
2,2008,69,88,89,58,13,97,86
3,2012,27,67,58,91,93,11,65
4,2016,10,31,46,27,42,15,44
5,2020,97,22,39,27,27,83,35
6,2024,66,84,75,12,43,43,66

In [37]:
be_indekso['Utena'] = np.random.randint(10, 71, 7)
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
0,2000,99,70,90,54,63,80,31,45
1,2004,70,60,79,25,32,13,66,55
2,2008,69,88,89,58,13,97,86,69
3,2012,27,67,58,91,93,11,65,50
4,2016,10,31,46,27,42,15,44,48
5,2020,97,22,39,27,27,83,35,47
6,2024,66,84,75,12,43,43,66,24

In [38]:
su_utena = be_indekso.set_index('index')
su_utena

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99,70,90,54,63,80,31,45
2004,70,60,79,25,32,13,66,55
2008,69,88,89,58,13,97,86,69
2012,27,67,58,91,93,11,65,50
2016,10,31,46,27,42,15,44,48
2020,97,22,39,27,27,83,35,47
2024,66,84,75,12,43,43,66,24

## antra dalis
---

fiktyviai sugadianm duomenis

In [39]:
su_nuostoliu = su_utena[su_utena > 20]
su_nuostoliu

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,70,90,54.0,63.0,80.0,31,45
2004,70.0,60,79,25.0,32.0,NaN,66,55
2008,69.0,88,89,58.0,NaN,97.0,86,69
2012,27.0,67,58,91.0,93.0,NaN,65,50
2016,NaN,31,46,27.0,42.0,NaN,44,48
2020,97.0,22,39,27.0,27.0,83.0,35,47
2024,66.0,84,75,NaN,43.0,43.0,66,24

tikrinam duomenų kokybę, kur jų trūksta

In [40]:
su_nuostoliu.isnull()

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,False,False,False,False,False,False,False,False
2004,False,False,False,False,False,True,False,False
2008,False,False,False,False,True,False,False,False
2012,False,False,False,False,False,True,False,False
2016,True,False,False,False,False,True,False,False
2020,False,False,False,False,False,False,False,False
2024,False,False,False,True,False,False,False,False

In [41]:
su_nuostoliu.isnull().sum()

Vilnius         1
Kaunas          0
Klaipeda        0
Panevezys       1
Alytus          1
Druskininkai    3
Kazlu Ruda      0
Utena           0
dtype: int64

In [42]:
su_nuostoliu['Klaipeda'].isnull()

index
2000    False
2004    False
2008    False
2012    False
2016    False
2020    False
2024    False
Name: Klaipeda, dtype: bool

In [43]:
su_nuostoliu['Klaipeda'].isnull().sum()

0

išmetam eilutes, kur duomenų trūksta

In [44]:
su_nuostoliu.dropna()

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,70,90,54.0,63.0,80.0,31,45
2020,97.0,22,39,27.0,27.0,83.0,35,47

išmetam stulpelius, kur duomenų trūksta

In [45]:
su_nuostoliu.dropna(axis=1)

       Kaunas  Klaipeda  Kazlu Ruda  Utena
index
2000       70        90          31     45
2004       60        79          66     55
2008       88        89          86     69
2012       67        58          65     50
2016       31        46          44     48
2020       22        39          35     47
2024       84        75          66     24

išmetam eilutes, kurių stulpelių duomenų kiekis neviršyja thresh

In [46]:
su_nuostoliu.dropna(thresh=7)

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,70,90,54.0,63.0,80.0,31,45
2004,70.0,60,79,25.0,32.0,NaN,66,55
2008,69.0,88,89,58.0,NaN,97.0,86,69
2012,27.0,67,58,91.0,93.0,NaN,65,50
2020,97.0,22,39,27.0,27.0,83.0,35,47
2024,66.0,84,75,NaN,43.0,43.0,66,24

išmetam stulpelius, kurių eilučių duomenų kiekis neviršyje thresh

In [47]:
su_nuostoliu.dropna(thresh=6, axis=1)

       Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Kazlu Ruda  Utena
index
2000      99.0      70        90       54.0    63.0          31     45
2004      70.0      60        79       25.0    32.0          66     55
2008      69.0      88        89       58.0     NaN          86     69
2012      27.0      67        58       91.0    93.0          65     50
2016       NaN      31        46       27.0    42.0          44     48
2020      97.0      22        39       27.0    27.0          35     47
2024      66.0      84        75        NaN    43.0          66     24

užpildom nesamus duomenis 'kiauras' reikšme

In [48]:
su_nuostoliu.fillna('kiauras')

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,70,90,54.0,63.0,80.0,31,45
2004,70.0,60,79,25.0,32.0,kiauras,66,55
2008,69.0,88,89,58.0,kiauras,97.0,86,69
2012,27.0,67,58,91.0,93.0,kiauras,65,50
2016,kiauras,31,46,27.0,42.0,kiauras,44,48
2020,97.0,22,39,27.0,27.0,83.0,35,47
2024,66.0,84,75,kiauras,43.0,43.0,66,24

užpildome trūkstamus duomenis stulpelių vidurkiais

In [49]:
su_nuostoliu['Klaipeda'].fillna(value=su_nuostoliu['Klaipeda'].mean())

index
2000    90
2004    79
2008    89
2012    58
2016    46
2020    39
2024    75
Name: Klaipeda, dtype: int32

In [50]:
padengti_nuostoliai = su_nuostoliu.fillna(value=su_nuostoliu.mean())
np.round(padengti_nuostoliai, 2)

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.00,70,90,54.0,63.0,80.00,31,45
2004,70.00,60,79,25.0,32.0,75.75,66,55
2008,69.00,88,89,58.0,50.0,97.00,86,69
2012,27.00,67,58,91.0,93.0,75.75,65,50
2016,71.33,31,46,27.0,42.0,75.75,44,48
2020,97.00,22,39,27.0,27.0,83.00,35,47
2024,66.00,84,75,47.0,43.0,43.00,66,24

### grupavimas

transponuojam lentelę, kad būtų patogiau dirbti su jos duomenimis

In [51]:
visi_miestai = su_utena.transpose()
visi_miestai

index         2000  2004  2008  2012  2016  2020  2024
Vilnius         99    70    69    27    10    97    66
Kaunas          70    60    88    67    31    22    84
Klaipeda        90    79    89    58    46    39    75
Panevezys       54    25    58    91    27    27    12
Alytus          63    32    13    93    42    27    43
Druskininkai    80    13    97    11    15    83    43
Kazlu Ruda      31    66    86    65    44    35    66
Utena           45    55    69    50    48    47    24

pridedam regionus

In [52]:
regionai = pd.Series([
    'Miestas', 
    'Miestas', 
    'Mazoji Lietuva',
    'Aukstaitija', 
    'Dzukija', 
    'Dzukija', 
    'Mazoji Lietuva', 
    'Aukstaitija'
])
laikini = visi_miestai.reset_index()
laikini['regionai'] = regionai
visi_miestai = laikini.set_index('index')
visi_miestai

index         2000  2004  2008  2012  2016  2020  2024        regionai
index
Vilnius         99    70    69    27    10    97    66         Miestas
Kaunas          70    60    88    67    31    22    84         Miestas
Klaipeda        90    79    89    58    46    39    75  Mazoji Lietuva
Panevezys       54    25    58    91    27    27    12     Aukstaitija
Alytus          63    32    13    93    42    27    43         Dzukija
Druskininkai    80    13    97    11    15    83    43         Dzukija
Kazlu Ruda      31    66    86    65    44    35    66  Mazoji Lietuva
Utena           45    55    69    50    48    47    24     Aukstaitija

sugrupuojam miestus pagal regionus, išvedam vidurkių lentelę

In [53]:
regionais = visi_miestai.groupby('regionai')
regionais.mean(numeric_only=True)

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija     49.5  40.0  63.5  70.5  37.5  37.0  18.0
Dzukija         71.5  22.5  55.0  52.0  28.5  55.0  43.0
Mazoji Lietuva  60.5  72.5  87.5  61.5  45.0  37.0  70.5
Miestas         84.5  65.0  78.5  47.0  20.5  59.5  75.0

regionų suma

In [54]:
regionais.sum(numeric_only=True)

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija       99    80   127   141    75    74    36
Dzukija          143    45   110   104    57   110    86
Mazoji Lietuva   121   145   175   123    90    74   141
Miestas          169   130   157    94    41   119   150

regionų skaičius (realiai visų duomenų bus vienodas)

In [55]:
regionais.count()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija        2     2     2     2     2     2     2
Dzukija            2     2     2     2     2     2     2
Mazoji Lietuva     2     2     2     2     2     2     2
Miestas            2     2     2     2     2     2     2

min/max

In [56]:
regionais.min()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija       45    25    58    50    27    27    12
Dzukija           63    13    13    11    15    27    43
Mazoji Lietuva    31    66    86    58    44    35    66
Miestas           70    60    69    27    10    22    66

In [57]:
regionais.max() - regionais.min()

index           2000  2004  2008  2012  2016  2020  2024
regionai
Aukstaitija        9    30    11    41    21    20    12
Dzukija           17    19    84    82    27    56     0
Mazoji Lietuva    59    13     3     7     2     4     9
Miestas           29    10    19    40    21    75    18

statistinė analizė vieno stulpelio duomens

In [58]:
regionais[2024].describe()

                count  mean        std   min    25%   50%    75%   max
regionai
Aukstaitija       2.0  18.0   8.485281  12.0  15.00  18.0  21.00  24.0
Dzukija           2.0  43.0   0.000000  43.0  43.00  43.0  43.00  43.0
Mazoji Lietuva    2.0  70.5   6.363961  66.0  68.25  70.5  72.75  75.0
Miestas           2.0  75.0  12.727922  66.0  70.50  75.0  79.50  84.0

In [71]:
regionais[2024].describe().transpose()['Miestas']

count     2.000000
mean     75.000000
std      12.727922
min      66.000000
25%      70.500000
50%      75.000000
75%      79.500000
max      84.000000
Name: Miestas, dtype: float64

### DF jungimas

pasidalinam duomenis

In [60]:
iki_2010 = visi_miestai[['regionai', 2000, 2004, 2008]].copy()
po_2010 = visi_miestai[['regionai', 2012, 2016, 2020, 2024]].copy()

In [61]:
top4 = visi_miestai[:'Panevezys'].copy()
bottom4 = visi_miestai['Alytus':].copy()

In [62]:
pd.concat([top4, bottom4])

index         2000  2004  2008  2012  2016  2020  2024        regionai
index
Vilnius         99    70    69    27    10    97    66         Miestas
Kaunas          70    60    88    67    31    22    84         Miestas
Klaipeda        90    79    89    58    46    39    75  Mazoji Lietuva
Panevezys       54    25    58    91    27    27    12     Aukstaitija
Alytus          63    32    13    93    42    27    43         Dzukija
Druskininkai    80    13    97    11    15    83    43         Dzukija
Kazlu Ruda      31    66    86    65    44    35    66  Mazoji Lietuva
Utena           45    55    69    50    48    47    24     Aukstaitija

In [63]:
pd.concat([top4, bottom4], axis=1)

index,2000,2004,2008,2012,2016,2020,2024,regionai,2000,2004,2008,2012,2016,2020,2024,regionai
index,,,,,,,,,,,,,,,,
Vilnius,99.0,70.0,69.0,27.0,10.0,97.0,66.0,Miestas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Kaunas,70.0,60.0,88.0,67.0,31.0,22.0,84.0,Miestas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Klaipeda,90.0,79.0,89.0,58.0,46.0,39.0,75.0,Mazoji Lietuva,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Panevezys,54.0,25.0,58.0,91.0,27.0,27.0,12.0,Aukstaitija,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Alytus,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,63.0,32.0,13.0,93.0,42.0,27.0,43.0,Dzukija
Druskininkai,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,80.0,13.0,97.0,11.0,15.0,83.0,43.0,Dzukija
Kazlu Ruda,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,31.0,66.0,86.0,65.0,44.0,35.0,66.0,Mazoji Lietuva
Utena,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,45.0,55.0,69.0,50.0,48.0,47.0,24.0,Aukstaitija

In [64]:
right4 = bottom4.reset_index()
right4.drop(columns='regionai', inplace=True)
right4

index         index  2000  2004  2008  2012  2016  2020  2024
0            Alytus    63    32    13    93    42    27    43
1      Druskininkai    80    13    97    11    15    83    43
2        Kazlu Ruda    31    66    86    65    44    35    66
3             Utena    45    55    69    50    48    47    24

In [65]:
left4 = top4.reset_index().drop(columns='regionai')
left4

index      index  2000  2004  2008  2012  2016  2020  2024
0        Vilnius    99    70    69    27    10    97    66
1         Kaunas    70    60    88    67    31    22    84
2       Klaipeda    90    79    89    58    46    39    75
3      Panevezys    54    25    58    91    27    27    12

In [66]:
pd.concat([left4, right4], axis=1)

index,index,2000,2004,2008,2012,2016,2020,2024,index,2000,2004,2008,2012,2016,2020,2024
0,Vilnius,99,70,69,27,10,97,66,Alytus,63,32,13,93,42,27,43
1,Kaunas,70,60,88,67,31,22,84,Druskininkai,80,13,97,11,15,83,43
2,Klaipeda,90,79,89,58,46,39,75,Kazlu Ruda,31,66,86,65,44,35,66
3,Panevezys,54,25,58,91,27,27,12,Utena,45,55,69,50,48,47,24

In [67]:
pd.concat([iki_2010, po_2010], axis=1).drop(columns='regionai', axis=1)

index         2000  2004  2008  2012  2016  2020  2024
index
Vilnius         99    70    69    27    10    97    66
Kaunas          70    60    88    67    31    22    84
Klaipeda        90    79    89    58    46    39    75
Panevezys       54    25    58    91    27    27    12
Alytus          63    32    13    93    42    27    43
Druskininkai    80    13    97    11    15    83    43
Kazlu Ruda      31    66    86    65    44    35    66
Utena           45    55    69    50    48    47    24

In [68]:
pd.merge(iki_2010, po_2010, on=['index', 'regionai'])

index               regionai  2000  2004  2008  2012  2016  2020  2024
index
Vilnius              Miestas    99    70    69    27    10    97    66
Kaunas               Miestas    70    60    88    67    31    22    84
Klaipeda      Mazoji Lietuva    90    79    89    58    46    39    75
Panevezys        Aukstaitija    54    25    58    91    27    27    12
Alytus               Dzukija    63    32    13    93    42    27    43
Druskininkai         Dzukija    80    13    97    11    15    83    43
Kazlu Ruda    Mazoji Lietuva    31    66    86    65    44    35    66
Utena            Aukstaitija    45    55    69    50    48    47    24

In [69]:
iki_2010.join(po_2010, lsuffix='', rsuffix=':R').drop(columns='regionai:R')

index               regionai  2000  2004  2008  2012  2016  2020  2024
index
Vilnius              Miestas    99    70    69    27    10    97    66
Kaunas               Miestas    70    60    88    67    31    22    84
Klaipeda      Mazoji Lietuva    90    79    89    58    46    39    75
Panevezys        Aukstaitija    54    25    58    91    27    27    12
Alytus               Dzukija    63    32    13    93    42    27    43
Druskininkai         Dzukija    80    13    97    11    15    83    43
Kazlu Ruda    Mazoji Lietuva    31    66    86    65    44    35    66
Utena            Aukstaitija    45    55    69    50    48    47    24

## Duomenų skaitymas/rašymas
---

In [129]:
top = pd.read_csv('top50.csv', encoding='ISO-8859-1')
top.head()

,Unnamed: 0,Track.Name,Artist.Name,Genre,Beats.Per.Minute,Energy,Danceability,Loudness..dB..,Liveness,Valence.,Length.,Acousticness..,Speechiness.,Popularity
0,1,Señorita,Shawn Mendes,canadian pop,117,55,76,-6,8,75,191,4,3,79
1,2,China,Anuel AA,reggaeton flow,105,81,79,-4,8,61,302,8,9,92
2,3,boyfriend (with Social House),Ariana Grande,dance pop,190,80,40,-4,16,70,186,12,46,85
3,4,Beautiful People (feat. Khalid),Ed Sheeran,pop,93,65,64,-8,8,55,198,12,19,86
4,5,Goodbyes (Feat. Young Thug),Post Malone,dfw rap,150,65,58,-4,11,18,175,45,7,94

In [131]:
top['Genre'].unique()

array(['canadian pop', 'reggaeton flow', 'dance pop', 'pop', 'dfw rap',
       'trap music', 'country rap', 'electropop', 'reggaeton',
       'panamanian pop', 'canadian hip hop', 'latin', 'escape room',
       'pop house', 'australian pop', 'edm', 'atl hip hop', 'big room',
       'boy band', 'r&b en espanol', 'brostep'], dtype=object)

In [132]:
top['Genre'].nunique()

21

In [133]:
top['Genre'].value_counts()

Genre
dance pop           8
pop                 7
latin               5
canadian hip hop    3
edm                 3
reggaeton           2
reggaeton flow      2
panamanian pop      2
canadian pop        2
electropop          2
country rap         2
dfw rap             2
brostep             2
trap music          1
escape room         1
pop house           1
australian pop      1
atl hip hop         1
big room            1
boy band            1
r&b en espanol      1
Name: count, dtype: int64

In [134]:
top['Length.'].sum()

10048

In [135]:
def minutes_seconds(length):
    return f"{length // 60}:{(length % 60):02d}"

In [136]:
top['Length.'].apply(minutes_seconds).head()

0    3:11
1    5:02
2    3:06
3    3:18
4    2:55
Name: Length., dtype: object

In [137]:
top['Length.Pretty'] = top['Length.'].apply(minutes_seconds)
top.head()

,Unnamed: 0,Track.Name,Artist.Name,Genre,Beats.Per.Minute,Energy,Danceability,Loudness..dB..,Liveness,Valence.,Length.,Acousticness..,Speechiness.,Popularity,Length.Pretty
0,1,Señorita,Shawn Mendes,canadian pop,117,55,76,-6,8,75,191,4,3,79,3:11
1,2,China,Anuel AA,reggaeton flow,105,81,79,-4,8,61,302,8,9,92,5:02
2,3,boyfriend (with Social House),Ariana Grande,dance pop,190,80,40,-4,16,70,186,12,46,85,3:06
3,4,Beautiful People (feat. Khalid),Ed Sheeran,pop,93,65,64,-8,8,55,198,12,19,86,3:18
4,5,Goodbyes (Feat. Young Thug),Post Malone,dfw rap,150,65,58,-4,11,18,175,45,7,94,2:55

In [138]:
top['Energy'].apply(lambda energy:energy // 10).head()

0    5
1    8
2    8
3    6
4    6
Name: Energy, dtype: int64

In [142]:
top.drop('Unnamed: 0', axis=1, inplace=True)

In [143]:
top.columns

Index(['Track.Name', 'Artist.Name', 'Genre', 'Beats.Per.Minute', 'Energy',
       'Danceability', 'Loudness..dB..', 'Liveness', 'Valence.', 'Length.',
       'Acousticness..', 'Speechiness.', 'Popularity', 'Length.Pretty'],
      dtype='object')

In [144]:
top.index

RangeIndex(start=0, stop=50, step=1)

In [145]:
top.shape

(50, 14)

In [148]:
top.sort_values('Beats.Per.Minute', ascending=False).head()

,Track.Name,Artist.Name,Genre,Beats.Per.Minute,Energy,Danceability,Loudness..dB..,Liveness,Valence.,Length.,Acousticness..,Speechiness.,Popularity,Length.Pretty
2,boyfriend (with Social House),Ariana Grande,dance pop,190,80,40,-4,16,70,186,12,46,85,3:06
6,Ransom,Lil Tecca,trap music,180,64,75,-6,7,23,131,2,29,92,2:11
10,Callaita,Bad Bunny,reggaeton,176,62,61,-5,24,24,251,60,31,93,4:11
36,Otro Trago,Sech,panamanian pop,176,70,75,-5,11,62,226,14,34,91,3:46
46,Te Robaré,Nicky Jam,latin,176,75,67,-4,8,80,202,24,6,88,3:22

In [150]:
top_speed = top.sort_values('Beats.Per.Minute', ascending=False)
top_speed.to_csv('top50_fastest.csv', index=True, index_label='Top.Index')

In [151]:
excel_writer = pd.ExcelWriter('top_speeed.xls', engine='xlsxwriter')
top_speed.to_excel(excel_writer, sheet_name='Fastest BPM')

### HTML

In [154]:
html_data = pd.read_html('https://lt.wikipedia.org/wiki/Vilniaus_miesto_savivaldyb%C4%97')

In [161]:
seniunijos = html_data[5]
seniunijos.head()

,Seniūnija,Plotas km²,Gyventojai (2023 m.),Gyventojų tankumas km² (2023 m.)
0,Antakalnio seniūnija,"77,2 km²",43027,557 žm./km²
1,Fabijoniškių seniūnija,"5,87 km²",37360,6365 žm./km²
2,Grigiškių seniūnija,"7,1 km²",10685,1505 žm./km²
3,Justiniškių seniūnija,"2,98 km²",26263,8813 žm./km²
4,Karoliniškių seniūnija,"4,0 km²",24643,6161 žm./km²

In [163]:
from sqlalchemy import create_engine
db_engine = create_engine('sqlite:///db/seniunijos.db')

In [164]:
seniunijos.to_sql('seniunijos', con=db_engine, index=False)

21

In [166]:
school_engine = create_engine('sqlite:///db/school/school.db')
schedule = pd.read_sql('schedule', con=school_engine)
schedule.head()

   id  weekday start_time  subject_id  classroom_id  teacher_id
0  41        0   08:00:00           1             1           1
1  42        0   13:00:00           2             1           2
2  43        1   08:00:00           1             1           1
3  44        1   13:00:00           3             1           3
4  45        2   08:00:00           1             1           1

In [171]:
query = '''SELECT weekday, start_time, subject.name, codename, teacher.last_name
FROM schedule
JOIN subject ON schedule.subject_id=subject.id
JOIN classroom ON schedule.classroom_id=classroom.id
JOIN teacher ON schedule.teacher_id=teacher.id;
'''
nice_schedule = pd.read_sql_query(query, con=school_engine)
nice_schedule

    weekday start_time        name codename  last_name
0         0   08:00:00      Python   code01  Petraitis
1         0   13:00:00  JavaScript   code01     Onaite
2         1   08:00:00      Python   code01  Petraitis
3         1   13:00:00    HTML/CSS   code01    Marijus
4         2   08:00:00      Python   code01  Petraitis
5         2   13:00:00  JavaScript   code01     Onaite
6         3   08:00:00      Python   code01  Petraitis
7         3   13:00:00    HTML/CSS   code01    Marijus
8         0   08:00:00      Python   code02    Rasaite
9         0   13:00:00    HTML/CSS   code02    Marijus
10        1   08:00:00      Python   code02    Rasaite
11        1   13:00:00  JavaScript   code02     Onaite
12        2   08:00:00      Python   code02    Rasaite
13        2   13:00:00    HTML/CSS   code02    Marijus
14        3   08:00:00      Python   code02    Rasaite
15        3   13:00:00  JavaScript   code02     Onaite
16        0   08:00:00  JavaScript   code03     Onaite
17        0   13:00:00      Python   code03  Petraitis
18        1   08:00:00    HTML/CSS   code03    Marijus
19        1   13:00:00      Python   code03  Petraitis
20        2   08:00:00  JavaScript   code03     Onaite
21        2   13:00:00      Python   code03  Petraitis
22        3   08:00:00    HTML/CSS   code03    Marijus
23        3   13:00:00      Python   code03  Petraitis
24        0   08:00:00    HTML/CSS   code04    Marijus
25        0   13:00:00      Python   code04    Rasaite
26        1   08:00:00  JavaScript   code04     Onaite
27        1   13:00:00      Python   code04    Rasaite
28        2   08:00:00    HTML/CSS   code04    Marijus
29        2   13:00:00      Python   code04    Rasaite
30        3   08:00:00  JavaScript   code04     Onaite
31        3   13:00:00      Python   code04    Rasaite